pschatzmann/ESP32-A2DP/src/BluetoothA2DPSource.cpp

// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//
// Copyright 2020 Phil Schatzmann
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD

#include "BluetoothA2DPSource.h"

#define BT_APP_SIG_WORK_DISPATCH (0x01)
#define BT_APP_SIG_WORK_DISPATCH (0x01)

#define APP_RC_CT_TL_RN_VOLUME_CHANGE (1)
#define BT_APP_HEART_BEAT_EVT (0xff00)

/* event for handler "bt_av_hdl_stack_up */
enum {
  BT_APP_EVT_STACK_UP = 0,
};

/* sub states of APP_AV_STATE_CONNECTED */
enum {
  APP_AV_MEDIA_STATE_IDLE,
  APP_AV_MEDIA_STATE_STARTING,
  APP_AV_MEDIA_STATE_STARTED,
  APP_AV_MEDIA_STATE_STOPPING,
};

BluetoothA2DPSource *actual_bluetooth_a2dp_source;

extern "C" void ccall_bt_av_hdl_stack_evt(uint16_t event, void *p_param) {
  if (actual_bluetooth_a2dp_source)
    actual_bluetooth_a2dp_source->bt_av_hdl_stack_evt(event, p_param);
}

extern "C" void ccall_bt_app_task_handler(void *arg) {
  if (actual_bluetooth_a2dp_source)
    actual_bluetooth_a2dp_source->bt_app_task_handler(arg);
}

extern "C" void ccall_bt_app_gap_callback(esp_bt_gap_cb_event_t event,
                                          esp_bt_gap_cb_param_t *param) {
  if (actual_bluetooth_a2dp_source)
    actual_bluetooth_a2dp_source->bt_app_gap_callback(event, param);
}

extern "C" void ccall_bt_app_rc_ct_cb(esp_avrc_ct_cb_event_t event,
                                      esp_avrc_ct_cb_param_t *param) {
  if (actual_bluetooth_a2dp_source)
    actual_bluetooth_a2dp_source->bt_app_rc_ct_cb(event, param);
}

extern "C" void ccall_a2d_app_heart_beat(TIMER_ARG_TYPE arg) {
  if (actual_bluetooth_a2dp_source)
    actual_bluetooth_a2dp_source->a2d_app_heart_beat(arg);
}

extern "C" void ccall_bt_app_a2d_cb(esp_a2d_cb_event_t event,
                                    esp_a2d_cb_param_t *param) {
  if (actual_bluetooth_a2dp_source)
    actual_bluetooth_a2dp_source->bt_app_a2d_cb(event, param);
}

extern "C" void ccall_bt_app_av_sm_hdlr(uint16_t event, void *param) {
  if (actual_bluetooth_a2dp_source)
    actual_bluetooth_a2dp_source->bt_app_av_sm_hdlr(event, param);
}

extern "C" void ccall_bt_av_hdl_avrc_ct_evt(uint16_t event, void *param) {
  if (actual_bluetooth_a2dp_source)
    actual_bluetooth_a2dp_source->bt_av_hdl_avrc_ct_evt(event, param);
}

extern "C" int32_t ccall_bt_app_a2d_data_cb(uint8_t *data, int32_t len) {
  // ESP_LOGD(BT_APP_TAG, "x%x - len: %d", __func__, len);
  if (actual_bluetooth_a2dp_source) 
    return actual_bluetooth_a2dp_source->get_audio_data_volume(data, len);
  return 0;
}

BluetoothA2DPSource::BluetoothA2DPSource() {
  ESP_LOGD(BT_APP_TAG, "%s, ", __func__);
  actual_bluetooth_a2dp_source = this;
  actual_bluetooth_a2dp_common = this;

  this->ssp_enabled = false;
  this->pin_type = ESP_BT_PIN_TYPE_VARIABLE;

  // default pin code
  strcpy((char *)pin_code, "1234");
  pin_code_len = 4;

  s_a2d_state = APP_AV_STATE_IDLE;
  s_media_state = APP_AV_MEDIA_STATE_IDLE;
  s_intv_cnt = 0;
  s_connecting_heatbeat_count = 0;
  s_pkt_cnt = 0;

  s_bt_app_task_queue = NULL;
  s_bt_app_task_handle = NULL;
}

BluetoothA2DPSource::~BluetoothA2DPSource() { end(); }

void BluetoothA2DPSource::set_pin_code(const char *pin_code,
                                       esp_bt_pin_type_t pin_type) {
  ESP_LOGD(BT_APP_TAG, "%s, ", __func__);
  this->pin_type = pin_type;
  this->pin_code_len = strlen(pin_code);
  strcpy((char *)this->pin_code, pin_code);
}

void BluetoothA2DPSource::start(std::vector<const char *> names) {
  ESP_LOGD(BT_APP_TAG, "%s, ", __func__);
  this->bt_names = names;
  is_autoreconnect_allowed = true;

  // get last connection if not available
  if (!has_last_connection()) {
    get_last_connection();
  }

  if (nvs_init) {
    // Initialize NVS (Non-volatile storage library).
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES ||
        ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
      ESP_ERROR_CHECK(nvs_flash_erase());
      ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
  }

  if (reset_ble) {
    ESP_ERROR_CHECK(esp_bt_controller_mem_release(ESP_BT_MODE_BLE));
  }

  if (!bt_start()) {
    ESP_LOGE(BT_AV_TAG, "Failed to initialize controller");
    return;
  }

  if (bluedroid_init() != ESP_OK) {
    ESP_LOGE(BT_AV_TAG, "%s initialize bluedroid failed\n", __func__);
    return;
  }

  if (esp_bluedroid_enable() != ESP_OK) {
    ESP_LOGE(BT_AV_TAG, "%s enable bluedroid failed\n", __func__);
    return;
  }

  if (ssp_enabled) {
    /* Set default parameters for Secure Simple Pairing */
    esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
    esp_bt_io_cap_t iocap = ESP_BT_IO_CAP_IO;
    esp_bt_gap_set_security_param(param_type, &iocap, sizeof(uint8_t));
  }

  /*
   * Set default parameters for Legacy Pairing
   * Use variable pin, input pin code when pairing
   */
  esp_bt_gap_set_pin(pin_type, 0, pin_code);

  /* create application task */
  bt_app_task_start_up();

  /* Bluetooth device name, connection mode and profile set up */
  bt_app_work_dispatch(ccall_bt_av_hdl_stack_evt, BT_APP_EVT_STACK_UP, NULL, 0,
                       NULL);
}

int32_t BluetoothA2DPSource::get_audio_data_volume(uint8_t *data, int32_t len) {
  int32_t result = get_audio_data(data, len);
  volume_control()->update_audio_data(data, len);
  return result;
}


int32_t BluetoothA2DPSource::get_audio_data(uint8_t *data, int32_t len) {
  if (get_data_cb != nullptr) {
    return get_data_cb(data, len);
  }
  if (get_data_in_frames_cb != nullptr) {
    return 4 * get_data_in_frames_cb((Frame *)data, len / 4);
  }
#ifdef ARDUINO
  if (p_stream != nullptr) {
    int32_t result = p_stream->readBytes(data, len);
    if (result > 0)
      return result;
    else
      p_stream = nullptr;
  }
  // determine next stream
  if (p_stream == nullptr && get_next_stream_cb != nullptr) {
    // get data from next stream
    p_stream = &get_next_stream_cb();
    if (p_stream) return p_stream->readBytes(data, len);
  }
#endif
  return 0;
}

void BluetoothA2DPSource::reset_last_connection() {
  ESP_LOGI(BT_APP_TAG, "%s, ", __func__);
  [[maybe_unused]] const char *bda_str = to_str(last_connection);
  ESP_LOGD(BT_APP_TAG, "last connection %s, ", bda_str);
  if (has_last_connection()) {
    // the device might not have noticed that we are diconnected
    disconnect();
    delay_ms(2000);
  }
}

