pschatzmann/ESP32-A2DP/src/BluetoothA2DPSource.cpp
void BluetoothA2DPSource::bt_app_rc_ct_cb(esp_avrc_ct_cb_event_t event,
                                          esp_avrc_ct_cb_param_t *param) {
  ESP_LOGD(BT_RC_CT_TAG, "%s evt %d", __func__, event);
  switch (event) {
    case ESP_AVRC_CT_CONNECTION_STATE_EVT:
    case ESP_AVRC_CT_PASSTHROUGH_RSP_EVT:
    case ESP_AVRC_CT_METADATA_RSP_EVT:
    case ESP_AVRC_CT_CHANGE_NOTIFY_EVT:
    case ESP_AVRC_CT_REMOTE_FEATURES_EVT:
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
    case ESP_AVRC_CT_GET_RN_CAPABILITIES_RSP_EVT:
    case ESP_AVRC_CT_SET_ABSOLUTE_VOLUME_RSP_EVT:
#endif
    {
      bt_app_work_dispatch(ccall_bt_av_hdl_avrc_ct_evt, event, param,
                           sizeof(esp_avrc_ct_cb_param_t), NULL);
      break;
    }
    default: {
      ESP_LOGW(BT_RC_CT_TAG, "Unhandled AVRC event: %d", event);
      break;
    }
  }
}

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)

void BluetoothA2DPSource::bt_av_volume_changed(void) {
  if (esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_TEST,
                                         &s_avrc_peer_rn_cap,
                                         ESP_AVRC_RN_VOLUME_CHANGE)) {
    esp_avrc_ct_send_register_notification_cmd(APP_RC_CT_TL_RN_VOLUME_CHANGE,
                                               ESP_AVRC_RN_VOLUME_CHANGE, 0);
  } else {
    ESP_LOGW(BT_RC_CT_TAG, "Unhandled event");
  }
}

void BluetoothA2DPSource::bt_av_notify_evt_handler(
    uint8_t event_id, esp_avrc_rn_param_t *event_parameter) {
  ESP_LOGD(BT_RC_CT_TAG, "%s evt %d", __func__, event_id);
  switch (event_id) {
    case ESP_AVRC_RN_VOLUME_CHANGE:
      ESP_LOGI(BT_RC_CT_TAG, "Volume changed: %d", event_parameter->volume);
      // limit the value to 127
      uint8_t new_volume = std::min((int)event_parameter->volume, 0x7f);
      ESP_LOGI(BT_RC_CT_TAG, "Set absolute volume: volume %d", new_volume);
      esp_avrc_ct_send_set_absolute_volume_cmd(APP_RC_CT_TL_RN_VOLUME_CHANGE,
                                               new_volume);
      set_volume(new_volume);
      bt_av_volume_changed();
      break;
  }
}

#endif

void BluetoothA2DPSource::bt_av_hdl_avrc_ct_evt(uint16_t event, void *p_param) {
  ESP_LOGD(BT_RC_CT_TAG, "%s evt %d", __func__, event);
  esp_avrc_ct_cb_param_t *rc = (esp_avrc_ct_cb_param_t *)(p_param);

  switch (event) {
    /* when connection state changed, this event comes */
    case ESP_AVRC_CT_CONNECTION_STATE_EVT: {
      [[maybe_unused]] uint8_t *bda = rc->conn_stat.remote_bda;
      ESP_LOGI(
          BT_RC_CT_TAG,
          "AVRC conn_state event: state %d, [%02x:%02x:%02x:%02x:%02x:%02x]",
          rc->conn_stat.connected, bda[0], bda[1], bda[2], bda[3], bda[4],
          bda[5]);

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
      if (rc->conn_stat.connected) {
        ESP_LOGI(BT_AV_TAG, "esp_avrc_ct_send_register_notification_cmd");
        uint8_t tl = 2;
        uint32_t event_par;
        for (auto event : avrc_rn_events) {
          if (esp_avrc_ct_send_register_notification_cmd(tl, event,
                                                         event_par) != ESP_OK) {
            ESP_LOGE(BT_AV_TAG,
                     "esp_avrc_ct_send_register_notification_cmd failed for %d",
                     event);
            if (++tl == 16) tl = 0;
          }
        }

        esp_avrc_ct_send_get_rn_capabilities_cmd(APP_RC_CT_TL_GET_CAPS);

      } else {
        s_avrc_peer_rn_cap.bits = 0;
      }

#endif
      break;
    }
    /* when passthrough responsed, this event comes */
    case ESP_AVRC_CT_PASSTHROUGH_RSP_EVT: {
#if ESP_IDF_VERSION <= ESP_IDF_VERSION_VAL(5, 1, 0)
      ESP_LOGI(BT_RC_CT_TAG,
               "AVRC passthrough response: key_code 0x%x, key_state %d",
               rc->psth_rsp.key_code, rc->psth_rsp.key_state);
#else
      ESP_LOGI(
          BT_RC_CT_TAG,
          "AVRC passthrough response: key_code 0x%x, key_state %d, rsp_code %d",
          rc->psth_rsp.key_code, rc->psth_rsp.key_state, rc->psth_rsp.rsp_code);
#endif
      break;
    }
    /* when metadata responsed, this event comes */
    case ESP_AVRC_CT_METADATA_RSP_EVT: {
      ESP_LOGI(BT_RC_CT_TAG, "AVRC metadata response: attribute id 0x%x, %s",
               rc->meta_rsp.attr_id, rc->meta_rsp.attr_text);
      free(rc->meta_rsp.attr_text);
      break;
    }
    /* when notification changed, this event comes */
    case ESP_AVRC_CT_CHANGE_NOTIFY_EVT: {
      ESP_LOGI(BT_RC_CT_TAG, "AVRC event notification: %d",
               rc->change_ntf.event_id);
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
      bt_av_notify_evt_handler(rc->change_ntf.event_id,
                               &rc->change_ntf.event_parameter);
#endif
      break;
    }
    /* when indicate feature of remote device, this event comes */
    case ESP_AVRC_CT_REMOTE_FEATURES_EVT: {
      ESP_LOGI(BT_RC_CT_TAG, "AVRC remote features %" PRIx32 ", TG features %x",
               rc->rmt_feats.feat_mask, rc->rmt_feats.tg_feat_flag);
      break;
    }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
    /* when get supported notification events capability of peer device, this
     * event comes */
    case ESP_AVRC_CT_GET_RN_CAPABILITIES_RSP_EVT: {
      ESP_LOGI(BT_RC_CT_TAG, "remote rn_cap: count %d, bitmask 0x%x",
               rc->get_rn_caps_rsp.cap_count, rc->get_rn_caps_rsp.evt_set.bits);
      s_avrc_peer_rn_cap.bits = rc->get_rn_caps_rsp.evt_set.bits;

      bt_av_volume_changed();
      break;
    }
    /* when set absolute volume responsed, this event comes */
    case ESP_AVRC_CT_SET_ABSOLUTE_VOLUME_RSP_EVT: {
      ESP_LOGI(BT_RC_CT_TAG, "Set absolute volume response: volume %d",
               rc->set_volume_rsp.volume);
      set_volume(rc->set_volume_rsp.volume);
      break;
    }
#endif
    /* other */
    default: {
      ESP_LOGW(BT_RC_CT_TAG, "%s unhandled event: %d", __func__, event);
      break;
    }
  }
}

void BluetoothA2DPSource::set_nvs_init(bool doInit) { nvs_init = doInit; }

void BluetoothA2DPSource::set_reset_ble(bool doInit) { reset_ble = doInit; }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)

